/*
*********************************************************************************************************
*	                                  
*	模块名称 : EEPROM读写演示模块。    
*	文件名称 : demo_i2c_eeprom.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _APP_TLC5973_H
#define _APP_TLC5973_H

#include "bsp_tlc5973.h"

void tlc_5973_test(void);

#endif


